Revit 2027 API
StructuralSectionGeneralCEx.FoldLength Property
 Fold segment length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FoldLength { get; set; }
Public Property FoldLength As Double
	Get
	Set
public:
property double FoldLength {
	double get ();
	void set (double value);
}
member FoldLength : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionGeneralCEx Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace